Autodesk.Revit.DB.Structure.LoadCaseCategory
Since:
2017
Specifies load case category.
Since:
2017

Autodesk.Revit.DB.Structure.LoadCaseCategory.Seismic
Seismic

Autodesk.Revit.DB.Structure.LoadCaseCategory.Temperature
Temperature

Autodesk.Revit.DB.Structure.LoadCaseCategory.Accidental
Accidental

Autodesk.Revit.DB.Structure.LoadCaseCategory.RoofLive
Roof Live

Autodesk.Revit.DB.Structure.LoadCaseCategory.Snow
Snow

Autodesk.Revit.DB.Structure.LoadCaseCategory.Wind
Wind

Autodesk.Revit.DB.Structure.LoadCaseCategory.Live
Live

Autodesk.Revit.DB.Structure.LoadCaseCategory.Dead
Dead